Wikitutorials/tutorials/incompressible/simpleFoam/pipeCyclic/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    f0;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name "side1";
        }
    }
    {
        name    f0;
        type    faceSet;
        action  subset;
        source  boxToFace;
        sourceInfo
        {
            box (0 -100 -100)(100 -0.2 100);
        }
    }
    {
        name    c0;
        type    cellSet;
        action  new;
        source  faceToCell;
        sourceInfo
        {
            set     f0;
            option  any;
        }
    }


    {
        name    walls;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name "walls";
        }
    }
    {
        name    c0;
        type    cellSet;
        action  delete;
        source  faceToCell;
        sourceInfo
        {
            set     walls;
            option  any;
        }
    }
);

// ************************************************************************* //
